import { INewsItem } from './types';

export const newsMockData: INewsItem[] = [
  {
    id: 1,
    tag: 'telecom',
    label: '+7Телеком',
    title:
      'много много много много текста много много много много текста много много много много текста',
    date: '2026-03-01',
  },
  {
    id: 2,
    tag: 'logistic',
    label: 'Логистика',
    title:
      'много много много много текста много много много много текста но не так прям много',
    date: '2026-03-02',
  },
  {
    id: 3,
    tag: 'connection',
    label: 'Связь',
    title: 'уже меньше чем много много много много текста',
    date: '2026-03-03',
  },
  {
    id: 4,
    tag: 'events',
    label: 'События',
    title: 'еще меньше чем много много много много текста',
    date: '2026-03-02',
  },
  {
    id: 5,
    tag: 'retail',
    label: 'Ретейл',
    title: 'мало текста',
    date: '2026-03-12',
  },
  {
    id: 6,
    tag: 'connection',
    label: 'Связь',
    title: 'столько же много много много текста',
    date: '2026-03-10',
  },
];
